# Show

## Description
Displays any hidden or grayed objects matching the specified search criteria.

```pascal
PROCEDURE Show(c : CRITERIA);
```

```python
def vs.Show(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Remarks
Makes objects with the specified search criteria visible if they are not already.

## Examples
==== VectorScript ====
```pascal
Show((C='Proposed Phase 2 Construction'));
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Criteria